
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 20 to add, 9 to change, 10 to destroy.</code></pre>

* Create
  * azurerm_network_security_group.dg_nsg
  * azurerm_network_security_rule.dg_allow_outbound
  * azurerm_private_dns_zone_virtual_network_link.ams_zone_link
  * azurerm_private_endpoint.ams_streamingendpoint_private_endpoint
  * azurerm_role_assignment.powerapp_appreg_sa2
  * azurerm_role_assignment.powerapp_appreg_sa_cont
  * azurerm_subnet_network_security_group_association.dg_subnet_nsg
  * module.finalsa_storage_account.azurerm_private_endpoint.this[0]
  * module.ingestsa_storage_account.azurerm_private_endpoint.this[0]
  * module.sa_storage_account.azurerm_private_endpoint.this[0]
  * module.vnet_peer_to_hub.azurerm_virtual_network_peering.initiator_to_target
  * module.vnet_peer_to_hub.azurerm_virtual_network_peering.target_to_initiator
* Update
  * azurerm_monitor_diagnostic_setting.storageblobfinalsa
  * azurerm_monitor_diagnostic_setting.storageblobingestsa
  * azurerm_monitor_diagnostic_setting.storageblobsa
  * module.ams_function_app.azurerm_linux_function_app.this[0]
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account.azurerm_storage_account.storage_account
  * module.key-vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.sa_storage_account.azurerm_storage_account.storage_account
* Delete
  * azurerm_virtual_network_peering.from_hub
  * azurerm_virtual_network_peering.to_hub
* Replace
  * azurerm_dev_test_global_vm_shutdown_schedule.powerbi_dg_vm[0]
  * azurerm_dev_test_global_vm_shutdown_schedule.powerbi_dg_vm[1]
  * module.powerBI_data_gateway[0].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;datadisk1&#34;]
  * module.powerBI_data_gateway[0].azurerm_virtual_machine_extension.vmextension[0]
  * module.powerBI_data_gateway[0].azurerm_windows_virtual_machine.winvm[0]
  * module.powerBI_data_gateway[1].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;datadisk1&#34;]
  * module.powerBI_data_gateway[1].azurerm_virtual_machine_extension.vmextension[0]
  * module.powerBI_data_gateway[1].azurerm_windows_virtual_machine.winvm[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault.keyvault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "keyvault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "pre-stg"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "pre-stg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # azurerm_dev_test_global_vm_shutdown_schedule.powerbi_dg_vm[0] must be replaced
-/+ resource "azurerm_dev_test_global_vm_shutdown_schedule" "powerbi_dg_vm" {
      ~ id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.DevTestLab/schedules/shutdown-computevm-powerbi-1-stg" -> (known after apply)
        tags                  = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
      ~ virtual_machine_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-1-stg" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)

      ~ notification_settings {
            # (2 unchanged attributes hidden)
        }
    }

  # azurerm_dev_test_global_vm_shutdown_schedule.powerbi_dg_vm[1] must be replaced
-/+ resource "azurerm_dev_test_global_vm_shutdown_schedule" "powerbi_dg_vm" {
      ~ id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.DevTestLab/schedules/shutdown-computevm-powerbi-2-stg" -> (known after apply)
        tags                  = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
      ~ virtual_machine_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-2-stg" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)

      ~ notification_settings {
            # (2 unchanged attributes hidden)
        }
    }

  # azurerm_monitor_diagnostic_setting.storageblobfinalsa will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "storageblobfinalsa" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg/blobServices/default|prefinalsastg"
        name                       = "prefinalsastg"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_monitor_diagnostic_setting.storageblobingestsa will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "storageblobingestsa" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg/blobServices/default|preingestsastg"
        name                       = "preingestsastg"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_monitor_diagnostic_setting.storageblobsa will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "storageblobsa" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg/blobServices/default|presastg"
        name                       = "presastg"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_network_security_group.dg_nsg will be created
  + resource "azurerm_network_security_group" "dg_nsg" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "dg-nsg-stg"
      + resource_group_name = "pre-stg"
      + security_rule       = (known after apply)
      + tags                = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
    }

  # azurerm_network_security_rule.dg_allow_outbound will be created
  + resource "azurerm_network_security_rule" "dg_allow_outbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "443",
          + "5671",
          + "5672",
          + "9350-9354",
        ]
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "dg_allow_outbound"
      + network_security_group_name = "dg-nsg-stg"
      + priority                    = 1000
      + protocol                    = "Tcp"
      + resource_group_name         = "pre-stg"
      + source_address_prefix       = "10.101.0.192/26"
      + source_port_range           = "*"
    }

  # azurerm_private_dns_zone_virtual_network_link.ams_zone_link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "ams_zone_link" {
      + id                    = (known after apply)
      + name                  = "pre-stg-virtual-network-link"
      + private_dns_zone_name = "privatelink.media.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + virtual_network_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg"
    }

  # azurerm_private_endpoint.ams_streamingendpoint_private_endpoint will be created
  + resource "azurerm_private_endpoint" "ams_streamingendpoint_private_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ams-streamingendpoint-pe-stg"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "pre-stg"
      + subnet_id                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-privatendpt-snet-stg"
      + tags                     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "ams-endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.media.azure.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ams-private-link-connection"
          + private_connection_resource_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Media/mediaServices/preamsstg"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "streamingendpoint",
            ]
        }
    }

  # azurerm_role_assignment.powerapp_appreg_sa2 will be created
  + resource "azurerm_role_assignment" "powerapp_appreg_sa2" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8cb76e1e-ef5a-41a7-9cb4-9513a48535dc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg-backup/providers/Microsoft.Storage/storageAccounts/presabackupstg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.powerapp_appreg_sa_cont will be created
  + resource "azurerm_role_assignment" "powerapp_appreg_sa_cont" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8cb76e1e-ef5a-41a7-9cb4-9513a48535dc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.dg_subnet_nsg will be created
  + resource "azurerm_subnet_network_security_group_association" "dg_subnet_nsg" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-datagateway-snet-stg"
    }

  # azurerm_virtual_network_peering.from_hub will be destroyed
  # (because azurerm_virtual_network_peering.from_hub is not in configuration)
  - resource "azurerm_virtual_network_peering" "from_hub" {
      - allow_forwarded_traffic      = true -> null
      - allow_gateway_transit        = false -> null
      - allow_virtual_network_access = true -> null
      - id                           = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-prod-int/virtualNetworkPeerings/pre-recorded-evidence" -> null
      - name                         = "pre-recorded-evidence" -> null
      - remote_virtual_network_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg" -> null
      - resource_group_name          = "hmcts-hub-prod-int" -> null
      - use_remote_gateways          = false -> null
      - virtual_network_name         = "hmcts-hub-prod-int" -> null
    }

  # azurerm_virtual_network_peering.to_hub will be destroyed
  # (because azurerm_virtual_network_peering.to_hub is not in configuration)
  - resource "azurerm_virtual_network_peering" "to_hub" {
      - allow_forwarded_traffic      = true -> null
      - allow_gateway_transit        = false -> null
      - allow_virtual_network_access = true -> null
      - id                           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/virtualNetworkPeerings/hub" -> null
      - name                         = "hub" -> null
      - remote_virtual_network_id    = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-prod-int" -> null
      - resource_group_name          = "pre-stg" -> null
      - use_remote_gateways          = false -> null
      - virtual_network_name         = "pre-vnet01-stg" -> null
    }

  # module.ams_function_app.azurerm_linux_function_app.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                       = {
          + "AZURE_STORAGE_ACCOUNT_KEY"         = (sensitive value)
          + "PREFINALSASTG_KEY"                 = (sensitive value)
          + "WEBSITE_ENABLE_SYNC_UPDATE_SITE"   = "false"
            # (13 unchanged elements hidden)
        }
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Web/sites/pre-ams-integration-stg"
        name                               = "pre-ams-integration-stg"
        tags                               = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (26 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.finalsa_storage_account.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "prefinalsastg"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "pre-stg"
      + subnet_id                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-privatendpt-snet-stg"
      + tags                     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "prefinalsastg"
          + private_connection_resource_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
        name                              = "prefinalsastg"
        tags                              = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (38 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "104.44.89.224/27",
              - "13.104.129.128/26",
              - "13.104.145.160/27",
              - "13.104.146.64/26",
              - "13.104.159.0/25",
              - "13.87.0.0/18",
              - "13.87.64.0/19",
              - "13.87.96.0/20",
              - "172.165.0.0/16",
              - "172.166.0.0/15",
              - "172.187.128.0/17",
              - "20.0.0.0/16",
              - "20.108.0.0/16",
              - "20.117.128.0/17",
              - "20.117.64.0/18",
              - "20.135.176.0/22",
              - "20.135.180.0/23",
              - "20.150.18.0/25",
              - "20.150.27.0/24",
              - "20.150.40.0/25",
              - "20.150.41.0/24",
              - "20.150.69.0/24",
              - "20.157.107.0/24",
              - "20.157.112.0/24",
              - "20.157.120.0/24",
              - "20.157.157.0/24",
              - "20.157.182.0/24",
              - "20.157.246.0/24",
              - "20.157.28.0/24",
              - "20.162.128.0/17",
              - "20.190.143.0/25",
              - "20.190.169.0/24",
              - "20.190.172.0/24",
              - "20.202.4.0/24",
              - "20.209.30.0/23",
              - "20.209.6.0/23",
              - "20.209.88.0/23",
              - "20.254.0.0/17",
              - "20.26.0.0/16",
              - "20.38.106.0/23",
              - "20.39.208.0/20",
              - "20.39.224.0/21",
              - "20.47.11.0/24",
              - "20.47.114.0/24",
              - "20.47.34.0/24",
              - "20.47.68.0/24",
              - "20.49.128.0/17",
              - "20.50.96.0/19",
              - "20.58.0.0/18",
              - "20.60.166.0/23",
              - "20.60.17.0/24",
              - "20.68.0.0/18",
              - "20.68.128.0/17",
              - "20.77.0.0/17",
              - "20.77.128.0/18",
              - "20.90.128.0/17",
              - "20.90.64.0/18",
              - "20.95.67.0/24",
              - "20.95.74.0/23",
              - "20.95.82.0/23",
              - "20.95.84.0/24",
              - "4.158.0.0/15",
              - "4.234.0.0/16",
              - "4.250.0.0/16",
              - "40.120.136.0/22",
              - "40.120.32.0/19",
              - "40.126.15.0/25",
              - "40.126.41.0/24",
              - "40.126.44.0/24",
              - "40.64.144.0/24",
              - "40.79.201.0/24",
              - "40.79.215.0/24",
              - "40.80.0.0/22",
              - "40.80.12.0/22",
              - "40.81.128.0/19",
              - "40.81.160.0/20",
              - "40.90.128.112/28",
              - "40.90.128.160/28",
              - "40.90.130.128/28",
              - "40.90.131.64/27",
              - "40.90.139.64/27",
              - "40.90.141.192/26",
              - "40.90.143.64/27",
              - "40.90.150.96/27",
              - "40.90.153.64/27",
              - "40.90.154.0/26",
              - "40.90.17.160/27",
              - "40.90.17.32/27",
              - "40.90.29.192/26",
              - "40.93.67.0/24",
              - "51.104.0.0/19",
              - "51.104.192.0/18",
              - "51.105.0.0/18",
              - "51.105.64.0/20",
              - "51.11.0.0/18",
              - "51.11.128.0/18",
              - "51.132.0.0/18",
              - "51.132.128.0/17",
              - "51.140.0.0/17",
              - "51.140.128.0/18",
              - "51.141.128.32/27",
              - "51.141.129.192/26",
              - "51.141.129.64/26",
              - "51.141.130.0/25",
              - "51.141.135.0/24",
              - "51.141.156.0/22",
              - "51.141.192.0/18",
              - "51.142.192.0/18",
              - "51.142.40.11",
              - "51.142.47.249",
              - "51.142.47.252",
              - "51.142.64.0/18",
              - "51.143.128.0/18",
              - "51.143.192.0/21",
              - "51.143.200.0/28",
              - "51.143.201.0/24",
              - "51.143.208.0/20",
              - "51.143.224.0/19",
              - "51.145.0.0/17",
              - "52.101.88.0/23",
              - "52.101.95.0/24",
              - "52.101.96.0/23",
              - "52.102.164.0/24",
              - "52.103.165.0/24",
              - "52.103.37.0/24",
              - "52.108.100.0/23",
              - "52.108.138.0/24",
              - "52.108.50.0/23",
              - "52.108.88.0/24",
              - "52.108.99.0/24",
              - "52.109.28.0/22",
              - "52.109.40.0/22",
              - "52.111.242.0/24",
              - "52.112.231.0/24",
              - "52.112.240.0/20",
              - "52.113.128.0/24",
              - "52.113.200.0/22",
              - "52.113.204.0/24",
              - "52.113.224.0/19",
              - "52.114.88.0/22",
              - "52.120.160.0/19",
              - "52.120.240.0/20",
              - "52.123.141.0/24",
              - "52.123.142.0/23",
              - "52.136.18.0/24",
              - "52.136.21.0/24",
              - "52.151.64.0/18",
              - "52.239.187.0/25",
              - "52.239.231.0/24",
              - "52.245.64.0/22",
              - "52.253.162.0/23",
            ]
          ~ virtual_network_subnet_ids = [
              - "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/iaas",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-datagateway-snet-stg",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-privatendpt-snet-stg",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-videoeditvm-snet-stg",
            ]
            # (2 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.ingestsa_storage_account.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "preingestsastg"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "pre-stg"
      + subnet_id                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-privatendpt-snet-stg"
      + tags                     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "preingestsastg"
          + private_connection_resource_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.ingestsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg"
        name                              = "preingestsastg"
        tags                              = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (38 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "104.44.89.224/27",
              - "13.104.129.128/26",
              - "13.104.145.160/27",
              - "13.104.146.64/26",
              - "13.104.159.0/25",
              - "13.87.0.0/18",
              - "13.87.64.0/19",
              - "13.87.96.0/20",
              - "172.165.0.0/16",
              - "172.166.0.0/15",
              - "172.187.128.0/17",
              - "20.0.0.0/16",
              - "20.108.0.0/16",
              - "20.117.128.0/17",
              - "20.117.64.0/18",
              - "20.135.176.0/22",
              - "20.135.180.0/23",
              - "20.150.18.0/25",
              - "20.150.27.0/24",
              - "20.150.40.0/25",
              - "20.150.41.0/24",
              - "20.150.69.0/24",
              - "20.157.107.0/24",
              - "20.157.112.0/24",
              - "20.157.120.0/24",
              - "20.157.157.0/24",
              - "20.157.182.0/24",
              - "20.157.246.0/24",
              - "20.157.28.0/24",
              - "20.162.128.0/17",
              - "20.190.143.0/25",
              - "20.190.169.0/24",
              - "20.190.172.0/24",
              - "20.202.4.0/24",
              - "20.209.30.0/23",
              - "20.209.6.0/23",
              - "20.209.88.0/23",
              - "20.254.0.0/17",
              - "20.26.0.0/16",
              - "20.38.106.0/23",
              - "20.39.208.0/20",
              - "20.39.224.0/21",
              - "20.47.11.0/24",
              - "20.47.114.0/24",
              - "20.47.34.0/24",
              - "20.47.68.0/24",
              - "20.49.128.0/17",
              - "20.50.96.0/19",
              - "20.58.0.0/18",
              - "20.60.166.0/23",
              - "20.60.17.0/24",
              - "20.68.0.0/18",
              - "20.68.128.0/17",
              - "20.77.0.0/17",
              - "20.77.128.0/18",
              - "20.90.128.0/17",
              - "20.90.64.0/18",
              - "20.95.67.0/24",
              - "20.95.74.0/23",
              - "20.95.82.0/23",
              - "20.95.84.0/24",
              - "4.158.0.0/15",
              - "4.234.0.0/16",
              - "4.250.0.0/16",
              - "40.120.136.0/22",
              - "40.120.32.0/19",
              - "40.126.15.0/25",
              - "40.126.41.0/24",
              - "40.126.44.0/24",
              - "40.64.144.0/24",
              - "40.79.201.0/24",
              - "40.79.215.0/24",
              - "40.80.0.0/22",
              - "40.80.12.0/22",
              - "40.81.128.0/19",
              - "40.81.160.0/20",
              - "40.90.128.112/28",
              - "40.90.128.160/28",
              - "40.90.130.128/28",
              - "40.90.131.64/27",
              - "40.90.139.64/27",
              - "40.90.141.192/26",
              - "40.90.143.64/27",
              - "40.90.150.96/27",
              - "40.90.153.64/27",
              - "40.90.154.0/26",
              - "40.90.17.160/27",
              - "40.90.17.32/27",
              - "40.90.29.192/26",
              - "40.93.67.0/24",
              - "51.104.0.0/19",
              - "51.104.192.0/18",
              - "51.105.0.0/18",
              - "51.105.64.0/20",
              - "51.11.0.0/18",
              - "51.11.128.0/18",
              - "51.132.0.0/18",
              - "51.132.128.0/17",
              - "51.140.0.0/17",
              - "51.140.128.0/18",
              - "51.141.128.32/27",
              - "51.141.129.192/26",
              - "51.141.129.64/26",
              - "51.141.130.0/25",
              - "51.141.135.0/24",
              - "51.141.156.0/22",
              - "51.141.192.0/18",
              - "51.142.192.0/18",
              - "51.142.40.11",
              - "51.142.47.249",
              - "51.142.47.252",
              - "51.142.64.0/18",
              - "51.143.128.0/18",
              - "51.143.192.0/21",
              - "51.143.200.0/28",
              - "51.143.201.0/24",
              - "51.143.208.0/20",
              - "51.143.224.0/19",
              - "51.145.0.0/17",
              - "52.101.88.0/23",
              - "52.101.95.0/24",
              - "52.101.96.0/23",
              - "52.102.164.0/24",
              - "52.103.165.0/24",
              - "52.103.37.0/24",
              - "52.108.100.0/23",
              - "52.108.138.0/24",
              - "52.108.50.0/23",
              - "52.108.88.0/24",
              - "52.108.99.0/24",
              - "52.109.28.0/22",
              - "52.109.40.0/22",
              - "52.111.242.0/24",
              - "52.112.231.0/24",
              - "52.112.240.0/20",
              - "52.113.128.0/24",
              - "52.113.200.0/22",
              - "52.113.204.0/24",
              - "52.113.224.0/19",
              - "52.114.88.0/22",
              - "52.120.160.0/19",
              - "52.120.240.0/20",
              - "52.123.141.0/24",
              - "52.123.142.0/23",
              - "52.136.18.0/24",
              - "52.136.21.0/24",
              - "52.151.64.0/18",
              - "52.239.187.0/25",
              - "52.239.231.0/24",
              - "52.245.64.0/22",
              - "52.253.162.0/23",
            ]
          ~ virtual_network_subnet_ids = [
              - "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/iaas",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-datagateway-snet-stg",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-privatendpt-snet-stg",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-videoeditvm-snet-stg",
            ]
            # (2 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.key-vault.azurerm_key_vault_access_policy.product_team_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ certificate_permissions = [
            "List",
          - "Get",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
            "GetIssuers",
            "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/objectId/b1fd4154-355f-4683-a795-d09cdb814d16"
      ~ key_permissions         = [
            "List",
          - "Get",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      ~ secret_permissions      = [
            "List",
          - "Get",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      ~ storage_permissions     = [
          - "List",
          - "Get",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg|pre-stg"
        name                       = "pre-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.powerBI_data_gateway[0].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments["datadisk1"] must be replaced
-/+ resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachments" {
      ~ id                        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-1-stg/dataDisks/powerbi-dg1-data-stg" -> (known after apply)
      ~ virtual_machine_id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-1-stg" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.powerBI_data_gateway[0].azurerm_virtual_machine_extension.vmextension[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "vmextension" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-1-stg/extensions/azure-disk-encrypt-9HCQ" -> (known after apply)
        name                        = "azure-disk-encrypt-9HCQ"
        tags                        = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
      ~ virtual_machine_id          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-1-stg" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.powerBI_data_gateway[0].azurerm_windows_virtual_machine.winvm[0] must be replaced
-/+ resource "azurerm_windows_virtual_machine" "winvm" {
      - availability_set_id           = "" -> null
      - capacity_reservation_group_id = "" -> null
      ~ computer_name                 = "powerbi-1-stg" -> "powerbi1stg" # forces replacement
      - dedicated_host_group_id       = "" -> null
      - dedicated_host_id             = "" -> null
      - edge_zone                     = "" -> null
      - encryption_at_host_enabled    = false -> null
      - eviction_policy               = "" -> null
      ~ id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-1-stg" -> (known after apply)
      - license_type                  = "" -> null
        name                          = "powerbi-1-stg"
      ~ private_ip_address            = "10.101.0.224" -> (known after apply)
      ~ private_ip_addresses          = [
          - "10.101.0.224",
        ] -> (known after apply)
      - proximity_placement_group_id  = "" -> null
      ~ public_ip_address             = "" -> (known after apply)
      ~ public_ip_addresses           = [] -> (known after apply)
      - secure_boot_enabled           = false -> null
      - source_image_id               = "" -> null
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
      - timezone                      = "" -> null
      - user_data                     = "" -> null
      ~ virtual_machine_id            = "29a50244-8bd5-478f-ae70-d6549bff1f05" -> (known after apply)
      - virtual_machine_scale_set_id  = "" -> null
      - vtpm_enabled                  = false -> null
        # (17 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb              = 127 -> (known after apply)
          ~ name                      = "powerbi-1-stg_disk1_2bfdfc8578fd4a3aa4fac35c311cb22e" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.powerBI_data_gateway[1].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments["datadisk1"] must be replaced
-/+ resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachments" {
      ~ id                        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-2-stg/dataDisks/powerbi-dg2-data-stg" -> (known after apply)
      ~ virtual_machine_id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-2-stg" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.powerBI_data_gateway[1].azurerm_virtual_machine_extension.vmextension[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "vmextension" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-2-stg/extensions/azure-disk-encrypt-gMLX" -> (known after apply)
        name                        = "azure-disk-encrypt-gMLX"
        tags                        = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
      ~ virtual_machine_id          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-2-stg" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.powerBI_data_gateway[1].azurerm_windows_virtual_machine.winvm[0] must be replaced
-/+ resource "azurerm_windows_virtual_machine" "winvm" {
      - availability_set_id           = "" -> null
      - capacity_reservation_group_id = "" -> null
      ~ computer_name                 = "powerbi-2-stg" -> "powerbi2stg" # forces replacement
      - dedicated_host_group_id       = "" -> null
      - dedicated_host_id             = "" -> null
      - edge_zone                     = "" -> null
      - encryption_at_host_enabled    = false -> null
      - eviction_policy               = "" -> null
      ~ id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-2-stg" -> (known after apply)
      - license_type                  = "" -> null
        name                          = "powerbi-2-stg"
      ~ private_ip_address            = "10.101.0.225" -> (known after apply)
      ~ private_ip_addresses          = [
          - "10.101.0.225",
        ] -> (known after apply)
      - proximity_placement_group_id  = "" -> null
      ~ public_ip_address             = "" -> (known after apply)
      ~ public_ip_addresses           = [] -> (known after apply)
      - secure_boot_enabled           = false -> null
      - source_image_id               = "" -> null
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
      - timezone                      = "" -> null
      - user_data                     = "" -> null
      ~ virtual_machine_id            = "8c7362ca-d238-4b5a-add7-a73d291fe985" -> (known after apply)
      - virtual_machine_scale_set_id  = "" -> null
      - vtpm_enabled                  = false -> null
        # (17 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb              = 127 -> (known after apply)
          ~ name                      = "powerbi-2-stg_OsDisk_1_251c1340ebb843bc8c88d80f625e5313" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.sa_storage_account.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "presastg"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "pre-stg"
      + subnet_id                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-privatendpt-snet-stg"
      + tags                     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "presastg"
          + private_connection_resource_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.sa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg"
        name                              = "presastg"
        tags                              = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (38 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "104.44.89.224/27",
              - "13.104.129.128/26",
              - "13.104.145.160/27",
              - "13.104.146.64/26",
              - "13.104.159.0/25",
              - "13.87.0.0/18",
              - "13.87.64.0/19",
              - "13.87.96.0/20",
              - "172.165.0.0/16",
              - "172.166.0.0/15",
              - "172.187.128.0/17",
              - "20.0.0.0/16",
              - "20.108.0.0/16",
              - "20.117.128.0/17",
              - "20.117.64.0/18",
              - "20.135.176.0/22",
              - "20.135.180.0/23",
              - "20.150.18.0/25",
              - "20.150.27.0/24",
              - "20.150.40.0/25",
              - "20.150.41.0/24",
              - "20.150.69.0/24",
              - "20.157.107.0/24",
              - "20.157.112.0/24",
              - "20.157.120.0/24",
              - "20.157.157.0/24",
              - "20.157.182.0/24",
              - "20.157.246.0/24",
              - "20.157.28.0/24",
              - "20.162.128.0/17",
              - "20.190.143.0/25",
              - "20.190.169.0/24",
              - "20.190.172.0/24",
              - "20.202.4.0/24",
              - "20.209.30.0/23",
              - "20.209.6.0/23",
              - "20.209.88.0/23",
              - "20.254.0.0/17",
              - "20.26.0.0/16",
              - "20.38.106.0/23",
              - "20.39.208.0/20",
              - "20.39.224.0/21",
              - "20.47.11.0/24",
              - "20.47.114.0/24",
              - "20.47.34.0/24",
              - "20.47.68.0/24",
              - "20.49.128.0/17",
              - "20.50.96.0/19",
              - "20.58.0.0/18",
              - "20.60.166.0/23",
              - "20.60.17.0/24",
              - "20.68.0.0/18",
              - "20.68.128.0/17",
              - "20.77.0.0/17",
              - "20.77.128.0/18",
              - "20.90.128.0/17",
              - "20.90.64.0/18",
              - "20.95.67.0/24",
              - "20.95.74.0/23",
              - "20.95.82.0/23",
              - "20.95.84.0/24",
              - "4.158.0.0/15",
              - "4.234.0.0/16",
              - "4.250.0.0/16",
              - "40.120.136.0/22",
              - "40.120.32.0/19",
              - "40.126.15.0/25",
              - "40.126.41.0/24",
              - "40.126.44.0/24",
              - "40.64.144.0/24",
              - "40.79.201.0/24",
              - "40.79.215.0/24",
              - "40.80.0.0/22",
              - "40.80.12.0/22",
              - "40.81.128.0/19",
              - "40.81.160.0/20",
              - "40.90.128.112/28",
              - "40.90.128.160/28",
              - "40.90.130.128/28",
              - "40.90.131.64/27",
              - "40.90.139.64/27",
              - "40.90.141.192/26",
              - "40.90.143.64/27",
              - "40.90.150.96/27",
              - "40.90.153.64/27",
              - "40.90.154.0/26",
              - "40.90.17.160/27",
              - "40.90.17.32/27",
              - "40.90.29.192/26",
              - "40.93.67.0/24",
              - "51.104.0.0/19",
              - "51.104.192.0/18",
              - "51.105.0.0/18",
              - "51.105.64.0/20",
              - "51.11.0.0/18",
              - "51.11.128.0/18",
              - "51.132.0.0/18",
              - "51.132.128.0/17",
              - "51.140.0.0/17",
              - "51.140.128.0/18",
              - "51.141.128.32/27",
              - "51.141.129.192/26",
              - "51.141.129.64/26",
              - "51.141.130.0/25",
              - "51.141.135.0/24",
              - "51.141.156.0/22",
              - "51.141.192.0/18",
              - "51.142.192.0/18",
              - "51.142.40.11",
              - "51.142.47.249",
              - "51.142.47.252",
              - "51.142.64.0/18",
              - "51.143.128.0/18",
              - "51.143.192.0/21",
              - "51.143.200.0/28",
              - "51.143.201.0/24",
              - "51.143.208.0/20",
              - "51.143.224.0/19",
              - "51.145.0.0/17",
              - "52.101.88.0/23",
              - "52.101.95.0/24",
              - "52.101.96.0/23",
              - "52.102.164.0/24",
              - "52.103.165.0/24",
              - "52.103.37.0/24",
              - "52.108.100.0/23",
              - "52.108.138.0/24",
              - "52.108.50.0/23",
              - "52.108.88.0/24",
              - "52.108.99.0/24",
              - "52.109.28.0/22",
              - "52.109.40.0/22",
              - "52.111.242.0/24",
              - "52.112.231.0/24",
              - "52.112.240.0/20",
              - "52.113.128.0/24",
              - "52.113.200.0/22",
              - "52.113.204.0/24",
              - "52.113.224.0/19",
              - "52.114.88.0/22",
              - "52.120.160.0/19",
              - "52.120.240.0/20",
              - "52.123.141.0/24",
              - "52.123.142.0/23",
              - "52.136.18.0/24",
              - "52.136.21.0/24",
              - "52.151.64.0/18",
              - "52.239.187.0/25",
              - "52.239.231.0/24",
              - "52.245.64.0/22",
              - "52.253.162.0/23",
            ]
          ~ virtual_network_subnet_ids = [
              - "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/iaas",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-datagateway-snet-stg",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-privatendpt-snet-stg",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-videoeditvm-snet-stg",
            ]
            # (2 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.vnet_peer_to_hub.azurerm_virtual_network_peering.initiator_to_target will be created
  + resource "azurerm_virtual_network_peering" "initiator_to_target" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "hub"
      + remote_virtual_network_id    = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-prod-int"
      + resource_group_name          = "pre-stg"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "pre-vnet01-stg"
    }

  # module.vnet_peer_to_hub.azurerm_virtual_network_peering.target_to_initiator will be created
  + resource "azurerm_virtual_network_peering" "target_to_initiator" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "pre-recorded-evidence"
      + remote_virtual_network_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg"
      + resource_group_name          = "hmcts-hub-prod-int"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "hmcts-hub-prod-int"
    }

Plan: 20 to add, 9 to change, 10 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":524,"Program":"tfcmt","SHA1":"","Vars":{}} -->